//
// Created by wm200618 on 2020/10/26.
//

#ifndef GL_HEXAGON_H
#define GL_HEXAGON_H

namespace model_hexagon {
    float vertices[] = {
            //     ---- 位置 ----       ---- 颜色 ----          - 纹理坐标 -
            -0.29f, 0.5f, 0.0f, 1.0f, 0.5f, 1.0f, 0.25f, 1.0f,
            0.29f, 0.5f, 0.0f, 0.5f, 0.5f, 0.0f, 0.75f, 1.0f,
            0.58f, 0.0f, 0.0f, 0.5f, 1.0f, 0.0f, 1.0f, 0.5f,
            0.29f, -0.5f, 0.0f, 0.5f, 0.0f, 1.0f, 0.75f, 0.0f,
            -0.29f, -0.5f, 0.0f, 1.0f, 0.5f, 0.0f, 0.25f, 0.0f,
            -0.58f, -0.0f, 0.0f, 0.5f, 0.1f, 1.0f, 0.0f, 0.5f,
            0.0f, 0.0f, 0.0f, 0.5f, 0.5f, 1.0f, 0.5f, 0.5f,
    };

    unsigned int indices[] = { // 注意索引从0开始!
            0, 1, 6, // 第一个三角形
            1, 2, 6,  // 第二个三角形
            2, 3, 6,  // 第二个三角形
            3, 4, 6,  // 第二个三角形
            4, 5, 6,  // 第二个三角形
            5, 0, 6,  // 第二个三角形
    };
}

#endif //GL_HEXAGON_H
